{
  "Apple___Apple_scab": "Remove and destroy infected leaves and fruit. Improve airflow by thinning canopy. Apply recommended fungicide during leaf emergence and wet periods; follow label instructions.",
  "Apple___Black_rot": "Prune and remove mummified fruit and infected branches. Remove nearby wild hosts. Apply fungicide during growing season if disease pressure is high.",
  "Apple___Cedar_apple_rust": "Remove nearby cedar/juniper hosts if feasible. Prune infected foliage and apply protective fungicide sprays during spore release periods.",
  "Apple___healthy": "Plant appears healthy. Maintain good practices: regular inspection, balanced fertilization, and proper irrigation.",
  "Blueberry___healthy": "Healthy. Maintain soil pH and avoid waterlogging. Monitor plants regularly for pests and disease signs.",
  "Cherry_(including_sour)___Powdery_mildew": "Remove or trim affected shoots, improve airflow and reduce humidity. Use sulfur or recommended fungicides when necessary.",
  "Cherry_(including_sour)___healthy": "Healthy. Maintain pruning and sanitation; monitor during wet seasons.",
  "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": "Remove volunteer plants and crop debris. Use resistant hybrids when available and rotate crops. Fungicide sprays can help in severe epidemics.",
  "Corn_(maize)___Common_rust_": "Crop rotation and resistant varieties help. Fungicides may be used when economic thresholds are reached; consult local guidelines.",
  "Corn_(maize)___Northern_Leaf_Blight": "Use resistant hybrids and rotate crops. Fungicide application may be needed for severe early infections.",
  "Corn_(maize)___healthy": "Healthy. Follow good crop management and monitor for leaf diseases during humid weather.",
  "Grape___Black_rot": "Remove and destroy infected fruit and canes. Prune to improve airflow. Apply fungicide during bloom and pre-harvest as recommended.",
  "Grape___Esca_(Black_Measles)": "Remove severely infected wood and practice proper sanitation. Consider professional diagnosis for advanced cases; follow vineyard best practices.",
  "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": "Remove infected leaves and improve canopy ventilation. Apply recommended fungicide sprays during wet periods.",
  "Grape___healthy": "Healthy. Continue pruning, monitoring, and appropriate fungicide program if history indicates risk.",
  "Orange___Haunglongbing_(Citrus_greening)": "This is a serious bacterial disease spread by psyllids. Remove infected trees where required by local regulations. Control psyllid vectors and consult extension services for area-specific measures.",
  "Peach___Bacterial_spot": "Remove infected fruit and prune affected shoots. Use copper sprays during bloom or early season as recommended and use resistant cultivars if available.",
  "Peach___healthy": "Healthy. Maintain good orchard sanitation and monitor for bacterial and fungal symptoms.",
  "Pepper,_bell___Bacterial_spot": "Remove infected leaves and fruit; avoid overhead irrigation. Use drip irrigation and copper-based sprays if recommended. Practice crop rotation.",
  "Pepper,_bell___healthy": "Healthy. Continue sanitation and monitor for pests and bacterial symptoms.",
  "Potato___Early_blight": "Remove and destroy infected foliage; avoid dense planting. Apply recommended protectant fungicides early in the season on a spray schedule.",
  "Potato___Late_blight": "Late blight can be severe: remove infected plants, avoid spreading, and apply appropriate fungicides immediately. Consult local extension for resistant varieties and spray programs.",
  "Potato___healthy": "Healthy. Practice crop rotation and inspect tubers and foliage regularly.",
  "Raspberry___healthy": "Healthy. Maintain good air movement, prune canes properly, and monitor for cane and fruit diseases.",
  "Soybean___healthy": "Healthy. Rotate crops and monitor for foliar or root diseases especially in wet conditions.",
  "Squash___Powdery_mildew": "Remove and destroy heavily infected leaves. Improve airflow and apply sulfur or registered fungicides as needed; avoid overhead watering.",
  "Strawberry___Leaf_scorch": "Remove and destroy severely infected leaves. Improve spacing and airflow. Control vectors and follow recommended chemical controls if necessary.",
  "Strawberry___healthy": "Healthy. Use good soil drainage, balanced nutrition and monitor for common strawberry pests and diseases.",
  "Tomato___Bacterial_spot": "Remove infected fruit and leaves. Avoid overhead irrigation and sanitize tools. Copper sprays may reduce spread; use disease-free transplants.",
  "Tomato___Early_blight": "Remove infected debris and lower leaves. Apply protective fungicides and practice crop rotation and resistant varieties where available.",
  "Tomato___Late_blight": "This can spread rapidly — remove infected plants, improve spacing, and apply fungicides promptly. Avoid moving wet plant material between fields.",
  "Tomato___Leaf_Mold": "Remove lower leaves and improve airflow in greenhouse production. Apply fungicides labeled for leaf mold and avoid humid conditions.",
  "Tomato___Septoria_leaf_spot": "Remove infected lower foliage and avoid overhead watering. Apply fungicides where necessary and rotate crops.",
  "Tomato___Spider_mites Two-spotted_spider_mite": "Control mites with targeted miticides or biological controls. Reduce dust and avoid plant stress; inspect underside of leaves and act early.",
  "Tomato___Target_Spot": "Remove infected debris and apply fungicide treatments as recommended. Maintain good irrigation practices and crop sanitation.",
  "Tomato___Tomato_Yellow_Leaf_Curl_Virus": "This is a viral disease spread by whiteflies. Remove infected plants and control whitefly vectors. Use resistant varieties where available.",
  "Tomato___Tomato_mosaic_virus": "Virus spread by contact — remove infected plants, sanitize tools and hands. Use certified seed and resistant varieties if possible.",
  "Tomato___healthy": "Healthy. Keep consistent watering, proper nutrition, and monitor regularly for pests and diseases."
}
